---
kind: property
id: P:Autodesk.Revit.UI.Events.MessageBoxData.DialogType
source: html/aa3faefa-dd2f-bf55-13bc-74927dc6b240.htm
---
# Autodesk.Revit.UI.Events.MessageBoxData.DialogType Property

An integer that describes the standard windows type of the dialog box.

## Syntax (C#)
```csharp
public int DialogType { get; }
```